{"basics":{"name":"Md Omar Faruque","label":"PhD Student","image":"","email":"faruque@nmsu.edu","phone":"(575) 650-1625","url":"","summary":"Hardware security PhD researcher with 2+ years background in VLSI design, verification, FPGA prototyping, and neural network accelerator design. Skilled in digital logic, computer architecture, analog circuits, signal processing, data mining, and deep learning algorithms.","location":{"address":"1305 Frenger St","postalCode":"NM 88001","city":"Las Cruces","countryCode":"US","region":"New Mexico"},"profiles":{"network":"Twitter","username":"AlbertEinstein","url":"https://twitter.com/AlbertEinstein"}},"education":[{"institution":"New Mexico State University (NMSU)","location":"NM, USA","url":"https://nmsu.edu/","area":"Program : Computer Engineering","studyType":"PhD","startDate":"2022-08-15","endDate":"2026-05-15","CGPA":"3.91/4.0","courses":["Selective Coursework: Hardware & Software Co-design, Computer Architecture, Analog VLSI Design, Hardware Security and Trust, Data Mining, Random Signal Analysis"]},{"institution":"Ahsanullah University of Science and Technology (AUST)","location":"Bangladesh","url":"https://www.aust.edu/","area":"Program : Electrical and Electronic Engineering (EEE)","studyType":"Bachelor's Degree","startDate":"2015-06-15","endDate":"2019-08-21","CGPA":"3.77/4.0","courses":["Selective Coursework: Power Electronics, Analog Integrated Circuits, Digital Logic Design, Microprocessor and Interfacing, VLSI I, Digital Signal Processing, Optoelectronics, Solid State Devices, Processing and Fabrication Technology"]}],"work":[{"name":"Klipsch School of Electrical and Computer Engineering, NMSU, USA","position":"Graduate Research Assistant","url":"https://ece.nmsu.edu/","startDate":"2022-08-15","endDate":"2026-05-15","summary":"I do research in Hardware Security and Trust. My current work focuses on developing novel hardware trojan attacks and countermeasures for computing hardware i.e, FPGAs, SoCs, ASICs. I am passionate about contributing to projects related to SoC/IP/AI accelerator design, computer architecture, analog/mixed-signal circuits, and machine learning","highlights":["NN Accelerator Security: Working on developing novel hardware trojan attacks for accuracy loss and developing countermeasures against various attacks on neural network accelerators.","PUF Based Authentication: Developed a technique to increase the entropy and reliability of a PUF-based authentication scheme. The proposed technique implemented on Xilinx Zynq7010 FPGA improves the portion of reliable (quadratically large) entropy bits by 20% and 100%, respectively, for different offset ranges."]},{"name":"Klipsch School of Electrical and Computer Engineering, NMSU, USA","position":"Graduate Teaching Assistant","url":"https://ece.nmsu.edu/","startDate":"2023-1-15","endDate":"2026-05-15","summary":"Instructed 30+ undergrad students in practical labs related to the analysis and design of op-amp circuits, diode circuits, MOS and BJT amplifiers using spice simulators.","highlights":["Courses Instructed : (EE 317) Semiconductors & Electronics, Spring’23, Fall’23"]},{"name":"City University, Bangladesh","position":"Lecturer, Dept. of EEE","url":"https://www.ige.ch/en.html","startDate":"1902-06-16","endDate":"1909-10-15","summary":"As a lecturer, I develop curriculum, conduct classes and labs, create assessments, grade assignments, supervise projects, perform research, and serve on academic committees. My core teaching duties involve classroom and hands-on instruction, designing tests, overseeing exams, guiding student research, and collaborating with faculty to enhance educational resources and knowledge in my field.","highlights":["Courses Instructed: Power Electronics, Power Electronics Laboratory, Analog Integrated Circuits, Structured Programming Language (C++), Digital System Design Laboratory, VLSI Design Laboratory."]}],"awards":[{"title":"Runners Up, NMSU Data Mining Contest","date":"2023-12-01","awarder":"Dept. of Computer Science, NMSU","url":"https://shorturl.at/hDLO9","summary":"Achieved 97% accuracy in customer query intent classification challenge"},{"title":"Dean’s List of Honor","date":"2019-08-21","awarder":"Dept. of EEE, AUST","url":"","summary":"Awarded for the excellent undergraduate result of CGPA 3.75 or above"},{"title":"Government Scholarship","date":"2009-12-30","awarder":"Education board, Bangladesh","url":"","summary":"Received govt. scholarship in junior scholarship examination"}],"certificates":[{"name":"Machine Learning","date":"2018-01-01","issuer":"Stanford University","url":"https://example.com","icon":"fa-solid fa-location-dot"},{"name":"Quantum Computing","date":"2018-01-01","issuer":"Stanford University","url":"https://example.com","icon":"fa-solid fa-tag"},{"name":"Quantum Information","date":"2018-01-01","issuer":"Stanford University","url":"https://example.com","icon":"fa-solid fa-envelope"},{"name":"Quantum Cryptography","date":"2018-01-01","issuer":"Stanford University","url":"https://example.com","icon":"fa-solid fa-hashtag"},{"name":"Quantum Communication","date":"2018-01-01","issuer":"Stanford University","url":"https://example.com","icon":"fa-solid fa-calendar"},{"name":"Quantum Teleportation","date":"2018-01-01","issuer":"Stanford University","url":"https://example.com","icon":"fa-solid fa-clipboard-check"}],"publications":[{"name":"Enlarging Reliable Pairs via Inter-Distance Offset for a PUF Entropy-Boosting Algorithm","publisher":"IEEE, 24th International Symposium on Quality Electronic Design (ISQED), San Francisco, CA, USA, 2023","releaseDate":"2023-04-05","url":"https://ieeexplore.ieee.org/abstract/document/10129308","summary":"Physically Unclonable Functions (PUFs) leverage chip manufacturing variations to generate unique device signatures. We propose an 'Inter-Distance Offset (IDO)' technique to boost the number of reliable entropy bits extracted from Ring Oscillator PUFs. Unreliable bit pairs are converted to reliable by adjusting the distance between oscillator frequencies to an appropriate offset range. Theoretical analysis shows the ratio of converted bit pairs can reach 20-100% for different offset settings without leaking information. Experimental results using FPGA-PUF datasets validate that IDO provides a lightweight way to improve the quadratic entropy scaling from N(N-1)/2 towards N^2, enhancing the usable secure secrets per device"},{"name":"Comparative Study of Effective Augmentation Method for Bangla ASR Using Convolutional Neural Network","publisher":"Springer Singapore, Emerging Technologies in Data Mining and Information Security: Proceedings of IEMIS 2020, Volume 1","releaseDate":"2021-06-29","url":"https://link.springer.com/chapter/10.1007/978-981-15-9927-9_20","summary":"This paper explores effective data augmentation techniques to improve accuracy for Bangla automatic speech recognition (ASR) using convolutional neural networks (CNNs). We implement time stretching, background noise injection, and pitch shifting to augment limited Bangla speech data. Experiments with linear predictive and mel frequency cepstral coefficients compare augmentation performance. Results show time stretching most consistently and effectively boosts accuracy for both feature types, increasing overall CNN model performance up to 27.27% relative to no augmentation. Pitch shifting also significantly improves accuracy. Noise injection is less impactful. This pioneering work illuminates optimal augmentation strategies for low-resource Bangla ASR using deep neural models."},{"name":"Effects of noise on RASTA-PLP and MFCC based Bangla ASR using CNN","publisher":"IEEE, 2020 IEEE Region 10 Symposium (TENSYMP)","releaseDate":"2020-06-05","url":"https://ieeexplore.ieee.org/abstract/document/9231034","summary":"Though Bangla Automatic Speech Recognition (ASR) started its journey since a long time ago, a paltry amount of work is done on Convolutional Neural Network (CNN) based ASR. In this paper, we propose an ASR made with CNN where the performance of two feature extraction methods, namely Mel Frequency Cepstral Coefficients (MFCC) and Relative Spectral Transform - Perceptual Linear Prediction (RASTA-PLP) are compared on Bangla isolated words consisting of digits and speech commands. This paper contributes to the literature of Bangla ASR in three ways. Firstly, Effects of noise is experimented on Bangla speech commands as well as isolated words in CNN based ASR. Secondly, the performance of MFCC and RASTA-PLP are compared in noisy environment using CNN based classifier. Lastly, state-of-the-art accuracy is achieved in CNN based ASR which is 93.18%."},{"name":"Naive Bayes based Trust management model for wireless body area networks","publisher":"ACM, 2020 International Conference on Computing Advancements (ICCA)","releaseDate":"2020-01-10","url":"https://dl.acm.org/doi/abs/10.1145/3377049.3377084","summary":"With the development of micro sensors, embedded technologies and wireless networking, Wireless Body Area Network (WBAN) is becoming a key emerging technology in healthcare to monitor and collect the biological data from the human body. Ensuring security of this network from compromised sensor nodes is a challenging task, as the traditional security mechanisms are not suitable and compatible with the lightweight body sensor nodes. In this paper, We have proposed a trust management model based on Naive Bayes classifier to classify a sensor node as trustworthy or malicious. Based on the classification the trustor node will choose a trustee node for the exchange of data. We have trained our proposed model in MATLAB and experimental results show that the proposed model can successfully classify a sensor node as a malicious or trusted.."},{"name":"Performance comparison between graphene nano-ribbon FET & conventional CMOS based on arithmetic logic unit (ALU)","publisher":"IEEE, 2019 International Conference on Advances in Science, Engineering and Robotics Technology (ICASERT)","releaseDate":"2019-05-03","url":"https://ieeexplore.ieee.org/abstract/document/8934488","summary":"This paper presents the implementation and analysis of GNRFET and Conventional CMOS based 1-bit and multi-bit Arithmetic Logic Unit (ALU). The simulation results calculated using HSPICE have reported to show 2.79% reduction in Propagation Delay (PD), 57.59% reduction in Average Power Consumption, 61.98% reduction in Power Delay Product (PDP) and 66.44% reduction in Energy Delay Product (EDP) for GNRFET base 1-bit ALU as compared to Conventional CMOS based 1-bit ALU at 32nm technology.."}],"skills":[{"name":"Programming Languages","icon":"fa-brands fa-codepen","keywords":["C/C++","Python","MATLAB","Verilog HDL","TCL","Bash"]},{"name":"EDA Tools & IDEs","icon":"fa-solid fa-diagram-project","keywords":["Cadence Virtuoso","Xilinx Vivado","Vitis HLS","OrCAD PSpice","Quartus Prime","HSPICE","PSpice"]},{"name":"Microcontrollers & Dev Boards","icon":"fa-solid fa-microchip","keywords":["Arduino UNO","Xilinx Zybo Z7","Xilinx PYNQ-Z1","Basys 3","Intel Altera DE2"]},{"name":"ML Frameworks & Libraries","icon":"fa-brands fa-python","keywords":["Scikit","TensorFlow","Keras","Numpy","Pandas","PyTorch","Hugging Face"]}],"languages":[{"language":"Bengali","fluency":"Native speaker"},{"language":"English","fluency":"Fluent"}],"interests":[{"name":"Programming","icon":"fa-brands fa-codepen","keywords":["C/C++","Python","Software Optimization"]},{"name":"Hardware Design","icon":"fa-solid fa-microchip","keywords":["VLSI","Verilog","FPGA Prototyping"]},{"name":"Machine Learning","icon":"fa-brands fa-python","keywords":["Neural Networks","Computer Vision","Inference Acceleration"]}],"projects":[{"name":"Cache Memory Simulator","summary":"Wrote a trace-based cache simulator in C to implement various cache mapping, cache replacement, and cache write policies.","highlights":["Skills: C Programming"],"url":"https://gitfront.io/r/user-8413178/3ppBg18jYynF/Cache-Simulator"},{"name":"Design and Implementation of a 32-bit MIPS CPU","summary":"Designed and implemented a 32-bit multi-cycle MIPS RISC processor with a pipelined datapath and FSM control unit in Verilog HDL. Simulated and verified the functionality of the CPU using testbenches and synthesized the RTL on an FPGA for prototyping.","highlights":["Skills: Verilog HDL, Vivado Design Suite, Xilinx Zybo Board"],"url":"https://github.com/mo-faruque/MIPS_Processor/"},{"name":"Physical Layout Design of a 4-Bit Arithmetic Logic Unit","summary":"Designed a complete schematic and layout of a 4-bit Arithmetic Logic Unit (ALU) with seven different functionalities and performed LVS, DRC, and STA analysis in gpdk090 technology using Cadence.","highlights":["Skills: Cadence Virtuoso"],"url":"https://drive.google.com/file/d/1SpP08xL6_4DlmGAkDXU1i7KF6fnZkBoi/view?pli=1"},{"name":"Face Mask and Temperature Detection Door Security","summary":"Developed a face detector model using Single Shot Detector (SSD) architecture and transfer learning to detect the presence or absence of a face mask and control the door accordingly. The results show that the model performs well on the test data with 100% and 99% precision and recall.","highlights":["Skills: OpenCV, Python"]},{"name":"Customer Query Intent Prediction with Fine Tuning a Pretrained Transformers Model","summary":"Utilized RoBERTa pretrained model for intent classification, finetuning with 18K queries across 150 intents. Achieved 100% validation accuracy in just 20 minutes and demonstrated 96.6% accuracy on the test set via transfer learning. Employed multi-GPU parallel training with 2 GPUs and a batch size of 760 for accelerated RoBERTa fine-tuning.","highlights":["Skills: Hugging Face Transformers Library, PyTorch, GPU Acceleration"],"url":"https://github.com/mo-faruque/RoBERTa_base_inquiry_classifier"}]}